# Introducción a Pandas en Python
Este notebook cubre conceptos básicos de Pandas en Python.

## Instalación de Pandas
Si no tienes Pandas instalado, puedes instalarlo con el siguiente comando:

In [ ]:
!pip install pandas

## Importación de Pandas

In [1]:
import pandas as pd

## 1. Creación de un DataFrame desde un diccionario

In [2]:
datos = {
    'Nombre': ['Ana', 'Juan', 'María', 'Carlos'],
    'Edad': [25, 30, 22, 35],
    'Ciudad': ['Madrid', 'Barcelona', 'Sevilla', 'Valencia']
}
df = pd.DataFrame(datos)
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Juan    30  Barcelona
2   María    22    Sevilla
3  Carlos    35   Valencia

## 2. Inspección del DataFrame

In [4]:
df.head()

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Juan    30  Barcelona
2   María    22    Sevilla
3  Carlos    35   Valencia

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nombre  4 non-null      object
 1   Edad    4 non-null      int64
 2   Ciudad  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [6]:
df.describe()

            Edad
count   4.000000
mean   28.000000
std     5.715476
min    22.000000
25%    24.250000
50%    27.500000
75%    31.250000
max    35.000000

## 3. Selección de Columnas

In [7]:
df['Nombre']

0       Ana
1      Juan
2     María
3    Carlos
Name: Nombre, dtype: object

## 4. Filtrado de Datos

In [8]:
df[df['Edad'] > 25]

   Nombre  Edad     Ciudad
1    Juan    30  Barcelona
3  Carlos    35   Valencia

## 5. Búsqueda de valores específicos

In [9]:
df[df['Ciudad'] == 'Madrid']

  Nombre  Edad  Ciudad
0    Ana    25  Madrid

## 6. Modificación de datos

In [10]:
df.loc[df['Nombre'] == 'Juan', 'Edad'] = 31
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Juan    31  Barcelona
2   María    22    Sevilla
3  Carlos    35   Valencia

## 7. Agregar nuevas columnas

In [11]:
df['Salario'] = [30000, 35000, 28000, 40000]
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Juan    31  Barcelona    35000
2   María    22    Sevilla    28000
3  Carlos    35   Valencia    40000

## 8. Eliminación de columnas

In [12]:
df = df.drop(columns=['Salario'])
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Juan    31  Barcelona
2   María    22    Sevilla
3  Carlos    35   Valencia

## 9. Ordenar Datos

In [13]:
df.sort_values(by='Edad', ascending=False)

   Nombre  Edad     Ciudad
3  Carlos    35   Valencia
1    Juan    31  Barcelona
0     Ana    25     Madrid
2   María    22    Sevilla

## 10. Agrupación de Datos

In [18]:
df_grouped = df.groupby('Ciudad')[['Edad']].mean()
df_grouped

           Edad
Ciudad
Barcelona  31.0
Madrid     25.0
Sevilla    22.0
Valencia   35.0

## 11. Lectura de datos desde un archivo CSV

Crea un archivo que se llame "archivo.csv" y en el contenido del archivo pegan lo siguiente:


Nombre,Edad,Ciudad
Ana,25,Madrid
Juan,31,Barcelona
María,22,Sevilla
Carlos,35,Valencia

In [22]:
df = pd.read_csv('archivo.csv')

## 12. Guardar el DataFrame en un archivo CSV

In [ ]:
df.to_csv('nuevo_archivo.csv', index=False)